Revit 2027 API
ParameterTypeId.StructFramJoinStatus Property
 "Join Status"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructFramJoinStatus { get; }
Public Shared ReadOnly Property StructFramJoinStatus As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructFramJoinStatus {
	ForgeTypeId^ get ();
}
static member StructFramJoinStatus : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace